bradhawkins85/ESP32-Uptime-Monitoring-Touch/src/main.cpp
#include <Arduino.h>
#include <WiFi.h>
#include <WiFiClientSecure.h>
#include <ESPAsyncWebServer.h>
#include <ArduinoJson.h>
#include <FS.h>
#include <LittleFS.h>
#include <HTTPClient.h>
#include <ESP32Ping.h>
#include <mbedtls/base64.h>
#include <LovyanGFX.hpp>
#include <Adafruit_FT6206.h>
#include <Wire.h>

#include "config.hpp"

bool isNtfyConfigured() {
  return strlen(NTFY_TOPIC) > 0;
}

bool isDiscordConfigured() {
  return strlen(DISCORD_WEBHOOK_URL) > 0;
}

bool isSmtpConfigured() {
  return strlen(SMTP_SERVER) > 0 && strlen(SMTP_FROM_ADDRESS) > 0 &&
         strlen(SMTP_TO_ADDRESS) > 0;
}

void sendNtfyNotification(const String& title, const String& message, const String& tags = "warning,monitor");
void sendDiscordNotification(const String& title, const String& message);
void sendSmtpNotification(const String& title, const String& message);

AsyncWebServer server(80);

// --- Display and touch configuration ---
#ifndef TFT_WIDTH
#define TFT_WIDTH 320
#endif

#ifndef TFT_HEIGHT
#define TFT_HEIGHT 480
#endif

#ifndef TFT_SCLK_PIN
#define TFT_SCLK_PIN 12
#endif

#ifndef TFT_MOSI_PIN
#define TFT_MOSI_PIN 11
#endif

#ifndef TFT_MISO_PIN
#define TFT_MISO_PIN -1
#endif

#ifndef TFT_CS_PIN
#define TFT_CS_PIN 10
#endif

#ifndef TFT_DC_PIN
#define TFT_DC_PIN 9
#endif

#ifndef TFT_RST_PIN
#define TFT_RST_PIN 14
#endif

#ifndef TFT_BL_PIN
#define TFT_BL_PIN 45
#endif

#ifndef TOUCH_SDA_PIN
#define TOUCH_SDA_PIN 38
#endif

#ifndef TOUCH_SCL_PIN
#define TOUCH_SCL_PIN 39
#endif

#ifndef TOUCH_INT_PIN
#define TOUCH_INT_PIN -1
#endif

class LGFX : public lgfx::LGFX_Device {
  lgfx::Panel_ST7796 _panel;
  lgfx::Bus_SPI _bus;

 public:
  LGFX() {
    {
      auto cfg = _bus.config();
      cfg.spi_host = SPI3_HOST;
      cfg.spi_mode = 0;
      cfg.freq_write = 60000000;
      cfg.freq_read = 16000000;
      cfg.pin_sclk = TFT_SCLK_PIN;
      cfg.pin_mosi = TFT_MOSI_PIN;
      cfg.pin_miso = TFT_MISO_PIN;
      cfg.pin_dc = TFT_DC_PIN;
      cfg.spi_3wire = TFT_MISO_PIN < 0;
      _bus.config(cfg);
      _panel.setBus(&_bus);
    }

    {
      auto cfg = _panel.config();
      cfg.pin_cs = TFT_CS_PIN;
      cfg.pin_rst = TFT_RST_PIN;
      cfg.pin_busy = -1;
      cfg.pin_bl = TFT_BL_PIN;
      cfg.bus_shared = true;
      cfg.panel_width = TFT_WIDTH;
      cfg.panel_height = TFT_HEIGHT;
      cfg.offset_x = 0;
      cfg.offset_y = 0;
      cfg.memory_width = TFT_WIDTH;
      cfg.memory_height = TFT_HEIGHT;
      cfg.readable = false;
      cfg.invert = false;
      cfg.rgb_order = false;
      cfg.dlen_16bit = false;
      cfg.bus_shared = true;
      _panel.config(cfg);
      _panel.setRotation(1);
    }

    setPanel(&_panel);
  }
};

LGFX display;
Adafruit_FT6206 touchController;
bool displayReady = false;
bool touchReady = false;
int currentServiceIndex = 0;
bool displayNeedsUpdate = true;
unsigned long lastDisplaySwitch = 0;
const unsigned long DISPLAY_ROTATION_INTERVAL = 8000;

// Service types
// Right now the behavior for each is rudimentary
// However, you can use this to expand and add services with more complex checks
enum ServiceType {
  TYPE_HOME_ASSISTANT,
  TYPE_JELLYFIN,
  TYPE_HTTP_GET,
  TYPE_PING
};

// Service structure
struct Service {
  String id;
  String name;
  ServiceType type;
  String host;
  int port;
  String path;
  String expectedResponse;
  int checkInterval;
  int passThreshold;      // Number of consecutive passes required to mark as UP
  int failThreshold;      // Number of consecutive fails required to mark as DOWN
  int consecutivePasses;  // Current count of consecutive passes
  int consecutiveFails;   // Current count of consecutive fails
  bool isUp;
  unsigned long lastCheck;
  unsigned long lastUptime;
  String lastError;
  int secondsSinceLastCheck;
};

// Store up to 20 services
const int MAX_SERVICES = 20;
Service services[MAX_SERVICES];
int serviceCount = 0;

// prototype declarations
void initWiFi();
void initWebServer();
void initFileSystem();
void initDisplay();
void loadServices();
void saveServices();
String generateServiceId();
void checkServices();
void sendOfflineNotification(const Service& service);
void sendOnlineNotification(const Service& service);
void sendSmtpNotification(const String& title, const String& message);
bool checkHomeAssistant(Service& service);
bool checkJellyfin(Service& service);
bool checkHttpGet(Service& service);
bool checkPing(Service& service);
String getWebPage();
String getServiceTypeString(ServiceType type);
String base64Encode(const String& input);
bool readSmtpResponse(WiFiClient& client, int expectedCode);
bool sendSmtpCommand(WiFiClient& client, const String& command, int expectedCode);
void renderServiceOnDisplay();
void handleDisplayLoop();

void setup() {
  Serial.begin(115200);
  delay(1000);

  Serial.println("Starting ESP32 Uptime Monitor...");

  // Initialize filesystem
  initFileSystem();

  // Initialize WiFi
  initWiFi();

  // Load saved services
  loadServices();

  // Initialize web server
  initWebServer();

  // Initialize display and touch controller (if connected)
  initDisplay();

  Serial.println("System ready!");
  Serial.print("Access web interface at: http://");
  Serial.println(WiFi.localIP());
}

void loop() {
  static unsigned long lastCheckTime = 0;
  unsigned long currentTime = millis();

  // Check services every 5 seconds
  if (currentTime - lastCheckTime >= 5000) {
    checkServices();
    lastCheckTime = currentTime;
  }

  handleDisplayLoop();

  delay(10);
}

void initWiFi() {
  Serial.println("Connecting to WiFi...");
  WiFi.mode(WIFI_STA);
  WiFi.begin(WIFI_SSID, WIFI_PASSWORD);

  int attempts = 0;
  while (WiFi.status() != WL_CONNECTED && attempts < 30) {
    delay(1000);
    Serial.print(".");
    attempts++;
  }

  if (WiFi.status() == WL_CONNECTED) {
    Serial.println("\nWiFi connected!");
    Serial.print("IP address: ");
    Serial.println(WiFi.localIP());
  } else {
    Serial.println("\nFailed to connect to WiFi!");
  }
}

void initFileSystem() {
  // First attempt: try to mount without formatting
  if (LittleFS.begin(false)) {
    Serial.println("LittleFS mounted successfully");
    return;
  }

  Serial.println("LittleFS mount failed, attempting format...");

