bradhawkins85/ESP32-Uptime-Monitoring-Touch/src/main.cpp
  Service& svc = services[currentServiceIndex];
  String status = svc.isUp ? "UP" : "DOWN";
  uint16_t statusColor = svc.isUp ? TFT_GREEN : TFT_RED;

  display.setTextSize(3);
  display.setTextColor(TFT_WHITE, TFT_BLACK);
  display.setCursor(10, 50);
  display.printf("%s (%d/%d)", svc.name.c_str(), currentServiceIndex + 1, serviceCount);

  display.fillRoundRect(10, 90, width - 20, 60, 12, TFT_NAVY);
  display.setTextSize(2);
  display.setCursor(20, 110);
  display.setTextColor(statusColor, TFT_NAVY);
  display.printf("Status: %s", status.c_str());

  display.setCursor(20, 150);
  display.setTextColor(TFT_YELLOW, TFT_BLACK);
  display.printf("Type: %s", getServiceTypeString(svc.type).c_str());

  display.setCursor(20, 180);
  display.setTextColor(TFT_WHITE, TFT_BLACK);
  display.printf("Host: %s:%d", svc.host.c_str(), svc.port);

  unsigned long sinceCheck = svc.lastCheck > 0 ? (millis() - svc.lastCheck) / 1000 : 0;
  display.setCursor(20, 210);
  if (svc.lastCheck == 0) {
    display.println("Last check: pending");
  } else {
    display.printf("Last check: %lus ago", sinceCheck);
  }

  if (svc.lastError.length() > 0) {
    display.setCursor(20, 240);
    display.setTextColor(TFT_RED, TFT_BLACK);
    display.printf("Error: %s", svc.lastError.c_str());
  }

  display.setTextColor(TFT_LIGHTGREY, TFT_BLACK);
  display.setCursor(10, height - 60);
  display.println("Tap left/right to switch");
  display.setCursor(10, height - 30);
  display.printf("Auto-rotate every %lus", DISPLAY_ROTATION_INTERVAL / 1000);
}

void handleDisplayLoop() {
  if (!displayReady) return;

  unsigned long now = millis();

  if (serviceCount > 0 && now - lastDisplaySwitch >= DISPLAY_ROTATION_INTERVAL) {
    currentServiceIndex = (currentServiceIndex + 1) % serviceCount;
    displayNeedsUpdate = true;
    lastDisplaySwitch = now;
  }

  if (touchReady && serviceCount > 0 && touchController.touched()) {
    TS_Point p = touchController.getPoint();
    int16_t x = map(p.y, 0, TFT_WIDTH, 0, display.width());
    int16_t y = map(p.x, 0, TFT_HEIGHT, 0, display.height());

    if (y > 20) {
      if (x < display.width() / 2) {
        currentServiceIndex = (currentServiceIndex - 1 + serviceCount) % serviceCount;
      } else {
        currentServiceIndex = (currentServiceIndex + 1) % serviceCount;
      }
      displayNeedsUpdate = true;
      lastDisplaySwitch = now;
      while (touchController.touched()) {
        delay(50);
      }
    }
  }

  if (displayNeedsUpdate) {
    renderServiceOnDisplay();
    displayNeedsUpdate = false;
  }
}

// technically just detectes any endpoint, so would be good to support auth and check if it's actually home assistant
// could parse /api/states or something to check there are valid entities and that it's actually HA
bool checkHomeAssistant(Service& service) {
  HTTPClient http;
  String url = "http://" + service.host + ":" + String(service.port) + "/api/";

  http.begin(url);
  http.setTimeout(5000);

  int httpCode = http.GET();
  bool isUp = false;

  if (httpCode > 0) {
      // HA returns 404 for /api/, but ANY positive HTTP status means the service is alive
      isUp = true;
  } else {
      service.lastError = "Connection failed: " + String(httpCode);
  }

  http.end();
  return isUp;
}

bool checkJellyfin(Service& service) {
  HTTPClient http;
  String url = "http://" + service.host + ":" + String(service.port) + "/health";

  http.begin(url);
  http.setTimeout(5000);

  int httpCode = http.GET();
  bool isUp = false;

  if (httpCode > 0) {
    if (httpCode == 200) {
      isUp = true;
    }
  } else {
    service.lastError = "Connection failed: " + String(httpCode);
  }

  http.end();
  return isUp;
}

bool checkHttpGet(Service& service) {
  HTTPClient http;
  String url = "http://" + service.host + ":" + String(service.port) + service.path;

  http.begin(url);
  http.setTimeout(5000);

  int httpCode = http.GET();
  bool isUp = false;

  if (httpCode > 0) {
    if (httpCode == 200) {
      if (service.expectedResponse == "*") {
        isUp = true;
      } else {
        String payload = http.getString();
        isUp = payload.indexOf(service.expectedResponse) >= 0;
        if (!isUp) {
          service.lastError = "Response mismatch";
        }
      }
    } else {
      service.lastError = "HTTP " + String(httpCode);
    }
  } else {
    service.lastError = "Connection failed: " + String(httpCode);
  }

  http.end();
  return isUp;
}

bool checkPing(Service& service) {
  bool success = Ping.ping(service.host.c_str(), 3);
  if (!success) {
    service.lastError = "Ping timeout";
  }
  return success;
}

void sendOfflineNotification(const Service& service) {
  if (!isNtfyConfigured() && !isDiscordConfigured() && !isSmtpConfigured()) {
    return;
  }

  if (WiFi.status() != WL_CONNECTED) {
    Serial.println("Skipping notifications: WiFi not connected");
    return;
  }

  String title = "Service DOWN: " + service.name;
  String message = "Service '" + service.name + "' at " + service.host;
  if (service.port > 0) {
    message += ":" + String(service.port);
  }
  message += " is offline.";

  if (service.lastError.length() > 0) {
    message += " Error: " + service.lastError;
  }

  if (isNtfyConfigured()) {
    sendNtfyNotification(title, message, "warning,monitor");
  }

  if (isDiscordConfigured()) {
    sendDiscordNotification(title, message);
  }

  if (isSmtpConfigured()) {
    sendSmtpNotification(title, message);
  }
}

void sendOnlineNotification(const Service& service) {
  if (!isNtfyConfigured() && !isDiscordConfigured() && !isSmtpConfigured()) {
    return;
  }

  if (WiFi.status() != WL_CONNECTED) {
    Serial.println("Skipping notifications: WiFi not connected");
    return;
  }

  String title = "Service UP: " + service.name;
  String message = "Service '" + service.name + "' at " + service.host;
  if (service.port > 0) {
    message += ":" + String(service.port);
  }
  message += " is back online.";

  if (isNtfyConfigured()) {
    sendNtfyNotification(title, message, "ok,monitor");
  }

